wegam/STM32F1xWorkSpace/Examples/WOW/AMPLCDV11.C
	ReceiveDataCheckStart:	//开始检测接收到的数据
  //-------------------------协议检查
  ampframe	=	(stampphydef*)API_AmpCheckFrame(StartAddr,&framlength);    //判断帧消息内容是否符合协议
  if(NULL== ampframe)
  {
    return;		//退出，未检测到有效的帧
  }
  //-------------------------检查是否为应答帧
	if(AmpCmdAck==ampframe->msg.cmd.cmd)
	{
		goto ReCheckData;		//重新检测剩余的数据
	}
  //-------------------------层地址检查
	if(sAmpLcd.Addr.Lay	!=	ampframe->msg.addr.address2)
	{
		goto ReCheckData;		//重新检测剩余的数据
	}
	//-------------------------位地址检查
	if(sAmpLcd.Addr.Seg	!=	ampframe->msg.addr.address3)
	{
		goto ReCheckData;		//重新检测剩余的数据
	}
 
  //-------------------------下发数据
  if(0  ==  ampframe->msg.cmd.dir)	//最高位为0表示上往下发
  {
    //---------------------------显示数据命令
    if(AmpCmdLcdData ==  ampframe->msg.cmd.cmd) 
    {	
			unsigned char* buffer=NULL;
			DataLen	=	ampframe->msg.length-4;		//数据段长度			
			buffer=(unsigned char*)ampframe->msg.data;
			PackManaData:
			GetManaData(buffer,DataLen);
			ackFrame(LayPort,1); //向上应答
						
    }
		//---------------------------修改背景色命令--只带2字节数据,低8位颜色在前
		else if(AmpCmdLcdBKCL ==  ampframe->msg.cmd.cmd)
		{
			unsigned short BackColor	=	0;			
			memcpy(&BackColor,ampframe->msg.data,2);	//2字节背景色数据，低位在前
			SetBackColor(BackColor);
			ackFrame(LayPort,1); //向上应答			
		}
		goto ReCheckData;		//重新检测剩余的数据
  }
	//------------------------------继续检查剩余数据，直到检查失败
	ReCheckData:
	StartAddr=(unsigned char*)&ampframe[1];
	framlength-=1;	//去掉一字节长度
	goto ReceiveDataCheckStart;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void GetManaData(unsigned char* Databuffer,unsigned short datalen)
{
	unsigned char	i=0;
	unsigned char DataLen	=0;		//数据段长度
	unsigned char red	=	0;
	unsigned char	green	=	0;
	unsigned char	blue	=	0;
	unsigned short color=0;
	unsigned char* buffer;
	ManaDef*	ManaData;
	DspDataDef*	DspData;		//
	
	ManaData	=	(ManaDef*)Databuffer;
	
	for(i=0;i<DspMaxNameTypeCount;i++)
	{
		if(0==sAmpLcd.DspData[i].Serial)		//缓存为空，可以拷贝数据
		{
			DspData	=	&sAmpLcd.DspData[i];
			sAmpLcd.ReceivedManaCount+=1;
			break;
		}
	}
	//------------------------------未查找到空缓存，缓存满
	if(i>=DspMaxNameTypeCount)
	{
		return;
	}
	//------------------------------分类拆装数据

	if(0x01	==	ManaData->type)	//名称参数
	{
		DspData->NameLen			=	ManaData->len;		//名称字符串长度
		DspData->NameFontSize	=	ManaData->FontSize;	//显示字符大小

		memcpy(DspData->String,ManaData->String,DspData->NameLen);	//拷贝名称数据
	}
	buffer=&ManaData->String[ManaData->len];
	ManaData=(ManaDef*)buffer;		
	if(0x02	==	ManaData->type)	//规格参数
	{
		DspData->SpecLen			=	ManaData->len;		//名称字符串长度
		DspData->SpecFontSize	=	ManaData->FontSize;	//显示字符大小

		memcpy(&DspData->String[DspData->NameLen],ManaData->String,DspData->SpecLen);	//拷贝名称数据
	}
	buffer=&ManaData->String[ManaData->len];
	ManaData=(ManaDef*)buffer;		
	if(0x03	==	ManaData->type)	//数量参数
	{
		DataLen	=	ManaData->len;
		if((0<DataLen)&&(DataLen<2))
		{
			DspData->Num			=	(ManaData->String[0]-0x30);		//数量
		}
		else if(2==DataLen)
		{
			DspData->Num			=	(ManaData->String[0]-0x30)*10;		//数量
			DspData->Num			+= (ManaData->String[1]-0x30);				//数量
		}
		else
		{
			DspData->Num=99;
		}
	}
	sAmpLcd.DspData[i].Serial=sAmpLcd.ReceivedManaCount;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaStaticTest1(void)
{
	unsigned char i=0;
	unsigned short x=0,y=0;
	unsigned short xysbac=0;
	unsigned char font=0;
	static unsigned char testnum=0;
	if(testnum++>=99)
		testnum=0;

	x	=	0;
	y	=	8;
	xysbac=y;
	//y=ystarttop;	//ystarttop==8
	//-----------------------------------画上边边线
	ST7789V_Fill(0,0,320,y+2,0x0000);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	y+=2;
	ST7789V_Fill(0,y-1,320,y+16,0x865D);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	ST7789V_PrintfBK(x,y,16,0x865D,0x0000,"层号:%0.2d  位号:%0.2d         %d/99::%d/99页",sAmpLcd.Addr.Lay%100,sAmpLcd.Addr.Seg%100,testnum%100,(testnum+1)%100);  //LCD显示测试Printf
	ST7789V_Fill(x,y+16,320,y+18,0x8450);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	y+=16+3;
	ST7789V_Fill(ST7789V_V-32*2,y+32+16+4,ST7789V_V,y+32+16+4+32,0xFFFF);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	ST7789V_PrintfBK(ST7789V_V-32*2,y+32+16+4,32,0xFFFF,0xFB00,"%0.2d",testnum%100);  //LCD显示测试Printf
	ST7789V_PrintfBK(ST7789V_V-32*1,y+31*2,16,0xFFFF,0xFB00,"盒");  //LCD显示测试Printf
//	y+=32;
	font=24;
	ST7789V_PrintfBK(x,y,font,0xFFFF,0x054A,"测试物品名称1测试物品名称1",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
	y+=font;
	ST7789V_PrintfBK(x,y,font,0xFFFF,0x054A,"一次性套管穿刺器一次性套管",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
	y+=font+2;
	font=16;
	ST7789V_Printf(x,y,font,0x5ACA,"Ⅲ型Ф10-MBQ2019FF1299-ACTD-MT",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
	ST7789V_Printf(x,y+16,font,0x5ACA,"#Яβπポほ㈣019FF1299-ACTD-M",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
	y+=font+2;
	
	//-----------------------------------画中线

	y	=	(ST7789V_H)/2-4+xysbac;
	ST7789V_Fill(0,y,320,y+8,0x8450);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	y+=10;
	
	ST7789V_Fill(ST7789V_V-32*2,y+32+16+4,ST7789V_V,y+32+16+4+32,0xFFFF);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	ST7789V_PrintfBK(ST7789V_V-32*2,y+32+16+4,32,0xFFFF,0xFB00,"%0.2d",testnum+1%100);  //LCD显示测试Printf
	ST7789V_PrintfBK(ST7789V_V-32*1,y+31*2,16,0xFFFF,0xFB00,"瓶");  //LCD显示测试Printf
//	y+=32;
	font=24;
	ST7789V_PrintfBK(x,y,font,0xFFFF,0x054A,"测试物品名称2测试物品名称2",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
	y+=font;
	ST7789V_PrintfBK(x,y,font,0xFFFF,0x054A,"（套管穿刺针）        ",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
	y+=font+2;
	font=16;
	ST7789V_Printf(x,y,font,0x5ACA,"Ⅲ型Ф10-MBQ2019FF1299-ACTD-MT",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
	y+=16;
	ST7789V_Printf(x,y,font,0x5ACA,"#Яβπポほ㈣019FF1299-ACTD-M",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
	y+=16;
	y+=16;
	ST7789V_Fill(0,y,320,ST7789V_H,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)

	testnum+=1;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaStaticTest2(void)
{
	unsigned char i	=	0;
	unsigned char len=0;
	unsigned char num=0;
	unsigned char* str;
	
	unsigned char TempLay	=	sAmpLcd.Addr.Lay%100;
	unsigned char TempSeg	=	sAmpLcd.Addr.Seg%100;

	
	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	unsigned short yebac=0;
	
	static unsigned char testnum=0;
	if(testnum++>=99)
		testnum=0;

	//===============================顶部填充
	ye=DisplayTopStartY;	
	ST7789V_Fill(0,0,ST7789V_V,ye,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================中间分隔线填充
//	ys	=	(DisplayBotStartY-DisplayTopStartY-DisplayTitleSize-DisplaySeparWidth)/2+DisplayTopStartY+DisplayTitleSize;
//	ST7789V_Fill(0,ys-DisplaySeparWidth,ST7789V_V,ys+DisplaySeparWidth,DisplaySeparBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	//===============================底部填充
	ys	=	DisplayBotStartY;
	ye	=	DisplayBotEndY;
	ST7789V_Fill(0,ys,ST7789V_V,ST7789V_H,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================标题填充
	ys	=	DisplayTopStartY;
	ye	=	DisplayTopStartY+DisplayTitleSize;
	ST7789V_Fill(0,ys,ST7789V_V,ye,DisplayTitleBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================标题分隔线填充
	ys	=	ye;
	ye	=	ys+DisplaySeparWidth;
	ST7789V_Fill(0,ys,ST7789V_V,ye,DisplaySeparBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	//===============================显示地址
	str=(unsigned char*)&sAmpLcd.Addr;
	ys	=	DisplayTopStartY;
	ST7789V_PrintfBK(DisplayStartX,ys,DisplayTitleSize,DisplayTitleBkColor,DisplayTitleFtColor,"%0.2d::%0.2d             01/03页",TempLay,TempSeg);  //LCD显示测试Printf
	
	//===============================显示别名/学名
	ys	=	ys+DisplayTitleSize+DisplaySeparWidth+1;
	ST7789V_PrintfBK(DisplayStartX,ys,DisplayNameFtSize,DisplayNameBkColor,DisplayNameFtColor,"无纺布食品车间防尘条形帽/医用一次性帽子");  //LCD显示测试Printf
	//===============================物料编码
	ys	=	ys+DisplayNameFtSize*2;
	ST7789V_PrintfBK(DisplayStartX,ys,DisplayCodeFtSize,DisplayCodeBkColor,DisplayCodeFtColor,"编码:POY20190315-M1");  //LCD显示测试Printf
	//===============================厂家
	ys	=	ys+DisplayCodeFtSize;
	ST7789V_PrintfBK(DisplayStartX,ys,DisplayVenderFtSize,DisplayVenderBkColor,DisplayVenderFtColor,"厂家:特斯拉中国 - Tesla");  //LCD显示测试Printf
	//===============================规格
	ys	=	ys+DisplayVenderFtSize;
	ST7789V_PrintfBK(DisplayStartX,ys,DisplaySpecFtSize,DisplaySpecBkColor,DisplaySpecFtColor,"规格:Red 1000x40000000cm");  //LCD显示测试Printf
	//===============================数量
	xs	=	ST7789V_V-DisplayNumFtSize*2;
	ys	=	ys+DisplaySpecFtSize-DisplayNumFtSize;
	ST7789V_PrintfBK(xs,ys,DisplayNumFtSize,DisplayNumBkColor,DisplayNumFtColor,"13包");  //LCD显示测试Printf
	
	//-----------------------------------画上边边线
//	ST7789V_Fill(0,0,320,y+2,0x0000);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	
//	y+=2;
//	ST7789V_Fill(0,y-1,320,y+16,0x865D);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	ST7789V_PrintfBK(x,y,16,0x865D,0x0000,"层号:%0.2d  位号:%0.2d         %d/99::%d/99页",sAmpLcd.Addr.Lay%100,sAmpLcd.Addr.Seg%100,testnum%100,(testnum+1)%100);  //LCD显示测试Printf
//	ST7789V_Fill(x,y+16,320,y+18,0x8450);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	
//	y+=16+3;
//	ST7789V_Fill(ST7789V_V-32*2,y+32+16+4,ST7789V_V,y+32+16+4+32,0xFFFF);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	ST7789V_PrintfBK(ST7789V_V-32*2,y+32+16+4,32,0xFFFF,0xFB00,"%0.2d",testnum%100);  //LCD显示测试Printf
//	ST7789V_PrintfBK(ST7789V_V-32*1,y+31*2,16,0xFFFF,0xFB00,"盒");  //LCD显示测试Printf
////	y+=32;
//	font=24;
//	ST7789V_PrintfBK(x,y,font,0xFFFF,0x054A,"测试物品名称1测试物品名称1",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
//	y+=font;
//	ST7789V_PrintfBK(x,y,font,0xFFFF,0x054A,"一次性套管穿刺器一次性套管",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
//	y+=font+2;
//	font=16;
//	ST7789V_Printf(x,y,font,0x5ACA,"Ⅲ型Ф10-MBQ2019FF1299-ACTD-MT",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
//	ST7789V_Printf(x,y+16,font,0x5ACA,"#Яβπポほ㈣019FF1299-ACTD-M",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
//	y+=font+2;
//	
//	//-----------------------------------画中线

